onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/InformationRegisters/бит_омни_Сообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_омни_Сообщения</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторОбсуждения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Message_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Контакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Боты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/InformationRegisters/бит_омни_Команды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_омни_Команды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Действия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/InformationRegisters/бит_омни_АктивныеРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_омни_АктивныеРассылки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаПоследнегоЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершенияПоследнегоЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рассылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Рассылки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Боты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_омни_ШаблоныСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтандартногоШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КнопкиMAX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоляШаблона</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АлгоритмРасчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_Контакты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_омни_Контакты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_омни_КаналыСвязи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Боты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_Боты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_омни_Боты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_омни_КаналыСвязи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_Рассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_омни_Рассылки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СКДПолучатели</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СКДКонтекст</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРассылки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_омни_РежимыРассылки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Принадлежность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/CommonModules/бит_омни_РаботаССообщениями/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьПолучателей(Источник) Экспорт
	
	ТипДокумента = Источник.Метаданные().ПолноеИмя();
	Обработчик = бит_омни_РаботаССообщениямПовтИсп.ОбработчикПолучателей(ТипДокумента);
	
	Попытка
		Возврат Вычислить(Обработчик + "(Источник)");
	Исключение
		Возврат Новый Массив;
	КонецПопытки;
	
КонецФункции

Процедура ОтправитьСообщениеВТелеграм(HTTPСоединения = Неопределено, ШаблонСообщения, Контекст = Неопределено, Получатели, Отправитель = Неопределено, Формат = Неопределено, Вложения = Неопределено, ОтправлятьОтправителю = Ложь) Экспорт
	
	Если HTTPСоединения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(HTTPСоединения) = Тип("СправочникСсылка.бит_омни_Боты") Тогда
		HTTPСоединения = СоздатьСоединение(HTTPСоединения);
	КонецЕсли;
	
	HTTPСоединение = HTTPСоединения.Основное;
	
	МассивКонтактов = Новый Массив;
	
	Если ТипЗнч(Получатели) <> Тип("Массив") Тогда
		мсПолучатели = Новый Массив;
		мсПолучатели.Добавить(Получатели);
	Иначе
		мсПолучатели = Получатели;
	КонецЕсли;
	
	Для Каждого Получатель Из мсПолучатели Цикл
		
		Если МассивКонтактов.Найти(Получатель) <> Неопределено Тогда 		
			Продолжить;	
		КонецЕсли;
		
		Если (ОтправлятьОтправителю ИЛИ Отправитель <> Получатель)
			И НЕ Получатель.Заблокирован 
		Тогда
			МассивКонтактов.Добавить(Получатель);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Получатель Из МассивКонтактов Цикл
		
		Если ТипЗнч(ШаблонСообщения) = Тип("ФорматированнаяСтрока") ИЛИ ТипЗнч(ШаблонСообщения) = Тип("Строка") Тогда
			ТекстСообщения = ШаблонСообщения;
		Иначе
			Формат = ШаблонСообщения.ВариантФормата;
			ТекстСообщения = СформироватьТекстСообщенияПоШаблону(ШаблонСообщения, Получатель, Контекст);
		КонецЕсли;
		
		ИдентификаторПолучателя = Получатель.Идентификатор;
		
		Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
			ОтправитьТекстовоеСообщение(HTTPСоединение, ИдентификаторПолучателя, ТекстСообщения, Контекст, Формат, HTTPСоединения.Бот);
		КонецЕсли;	
		
		Если Вложения <> Неопределено Тогда
			
			Для Каждого Вложение Из Вложения Цикл
				ОтправитьВложение(HTTPСоединение, ИдентификаторПолучателя, Вложение, Контекст, HTTPСоединения.Бот);
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьИнформациюОБоте(ИдентификаторБота) Экспорт
	
	СтруктураБота = Новый Структура("Идентификатор", ИдентификаторБота);
	HTTPСоединение = СоздатьСоединение(СтруктураБота);
	HTTPЗапрос = Новый HTTPЗапрос("getMe");
	HTTPОТвет = HTTPСоединение.Основное.Получить(HTTPЗапрос);
	
	ДанныеСтрокой = HTTPОтвет.ПолучитьТелоКакСтроку();	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеСтрокой);
	
	РезультатЗапроса = ПрочитатьJSON(ЧтениеJSON);
	Возврат РезультатЗапроса.result;
	
КонецФункции

Функция СформироватьТекстСообщенияПоШаблону(Шаблон, Получатель, Контекст) Экспорт
	
	ТекстСообщения = Шаблон.ШаблонСообщения;
	НачалоБлока = ?(Шаблон.ВариантФормата = "HTML", "{{ ", "<");
	КонецБлока = ?(Шаблон.ВариантФормата = "HTML", " }}", ">"); 
	
	Для Каждого ПолеШаблона Из Шаблон.ПоляШаблона Цикл
		Поле = НачалоБлока + ПолеШаблона.Поле + КонецБлока;
		Результат = "";
		Выполнить(ПолеШаблона.АлгоритмРасчета);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, Поле, Результат);
	КонецЦикла;
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ЗначениеПоляКонтекста(Контекст, ИмяПоля)

	// Алгоритмы полей шаблона выполняются в контексте этого общего модуля.
	Возврат Справочники.бит_омни_ШаблоныСообщений.ЗначениеПоляКонтекста(Контекст, ИмяПоля);

КонецФункции

Функция Упоминание(Контакт) Экспорт

	Шаблон = "<a href=""tg://user?id=%2"">%1</a>";
	Возврат СтрШаблон(Шаблон, ?(Контакт.Пользователь1С.Пустая(), Контакт.Наименование, Контакт.Пользователь1С), Формат(Контакт.Идентификатор, "ЧГ=0"));

КонецФункции

#КонецОбласти

#Область РегламентныеИФоновыеЗадания

Процедура ПолучениеСообщений() Экспорт
	// Для MAX используется webhook HTTP-сервиса, LongPolling не применяется.
КонецПроцедуры 

Процедура Рассылки() Экспорт
	
	Боты = ПолучитьАктивныхБотов();
	
	Для Каждого Бот Из Боты Цикл
		HTTPСоединения = СоздатьСоединение(Бот);
		ОбработатьРассылкиПоБоту(HTTPСоединения);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВходящиеСообщения

Процедура ПолучитьОбновления(Знач HTTPСоединения)
	
	Смещение = HTTPСоединения.Бот.Смещение;
	
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("offset", ?(Смещение = Неопределено, 0, Смещение + 1));

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураСообщения);
	
	СтрокаЗапроса = ЗаписьJSON.Закрыть();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Host", "api.telegram.org");

	HTTPЗапрос = Новый HTTPЗапрос("/disabledGetUpdates", Заголовки);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса);

	HTTPОтвет = HTTPСоединения.Основное.ОтправитьДляОбработки(HTTPЗапрос);

	ДанныеСтрокой = HTTPОтвет.ПолучитьТелоКакСтроку();	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеСтрокой);
	
	Данные = ПрочитатьJSON(ЧтениеJSON);
	
	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;  
		
	Если НЕ Данные.Свойство("result") ИЛИ ТипЗнч(Данные.result) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаИзменений Из Данные.result Цикл
		Если ТипЗнч(СтрокаИзменений) <> Тип("Структура") ИЛИ НЕ СтрокаИзменений.Свойство("message") Тогда
			Продолжить;
		КонецЕсли;
		
		Смещение = СтрокаИзменений.update_id;
		Сообщение = СтрокаИзменений.message;
		
		Получатель = ПолучитьКонтактПоUser(Сообщение.from);
		
		Если Сообщение.chat.type <> "private" Тогда
			Чат = ПолучитьКонтактПоUser(Сообщение.chat);
		КонецЕсли;
		
		Контекст = Неопределено;
		ЭтоКоманда = Ложь;
		
		Если СтрокаИзменений.message.Свойство("text") 
			И СтрокаИзменений.message.Свойство("entities")
		Тогда
			Для Каждого entitity Из СтрокаИзменений.message.entities Цикл
				Если entitity.type = "bot_command" Тогда
					Команда = Сред(Сообщение.text, entitity.offset + 1, entitity.length);
					ЭтоКоманда = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ЭтоКоманда Тогда
			ОбработатьКоманду(HTTPСоединения, Получатель, Сообщение, Контекст, Команда);
		Иначе
			ОбработатьСообщение(HTTPСоединения, СтрокаИзменений.message, Получатель);
		КонецЕсли;
		
		ЗарегистрироватьСообщение(СтрокаИзменений.message.message_id, Контекст, Получатель, HTTPСоединения.Бот);
	КонецЦикла;
			
	ИзменитьСмещение(HTTPСоединения.Бот, Смещение);
		
КонецПроцедуры

Процедура ОбработатьСообщение(HTTPСоединения, message, Контакт)
		
	Если НЕ message.Свойство("reply_to_message") Тогда
		Возврат; //Простое текстовое сообщение без привязки к чему-либо, пока не придумал зачем бы это понадобилось
	КонецЕсли;
	
	нзСообщений = РегистрыСведений.бит_омни_Сообщения.СоздатьНаборЗаписей();
	нзСообщений.Отбор.Message_id.Установить(message.reply_to_message.message_id);
	нзСообщений.Прочитать();
	
	Если нзСообщений.Количество() > 0 Тогда
    	//TODO посмотрим надо ли это
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьКоманду(Знач HTTPСоединения, Получатель, Знач Сообщение, Обсуждение, Команда)
	
	ДействиеКоманды = РегистрыСведений.бит_омни_Команды.СоздатьМенеджерЗаписи();
	ДействиеКоманды.Команда = Сред(Команда, 2);
	ДействиеКоманды.Прочитать();
	
	Если ДействиеКоманды.Выбран() И НЕ ДействиеКоманды.Действие.Пустая() Тогда
		Результат = Справочники.бит_омни_Действия.ВыполнитьДействие(ДействиеКоманды.Действие, Сообщение.text, Получатель, HTTPСоединения.Бот.Ссылка); 
		Если Результат.Ошибка Тогда
			ЗаписьЖурналаРегистрации(". Ошибка выполнения", УровеньЖурналаРегистрации.Ошибка,,ДействиеКоманды.Действие, Результат.Описание); 
		КонецЕсли;
	КонецЕсли;
	
	//Если Команда = "/start" Тогда
	//	
	//	Если ЗначениеЗаполнено(Получатель.Пользователь1С) Тогда
	//		Шаблон = Справочники.бит_омни_ШаблоныСообщений.КомандаLoginОтказ;
	//	Иначе
	//		Шаблон = Справочники.бит_омни_ШаблоныСообщений.КомандаStart;
	//	КонецЕсли;
	//	
	//	ТекстСообщения = СформироватьТекстСообщенияПоШаблону(Шаблон, Получатель, Неопределено);
	//	
	//	ОтправитьТекстовоеСообщение(HTTPСоединения.Основное,Получатель.Идентификатор, ТекстСообщения,,,HTTPСоединения.Бот);
	//	
	//ИначеЕсли Команда = "/login" Тогда
	//	
	//	Если НЕ Получатель.Пользователь1С.Пустая() Тогда
	//		
	//		Шаблон = Справочники.бит_омни_ШаблоныСообщений.КомандаLoginОтказ;
	//		ТекстСообщения = СформироватьТекстСообщенияПоШаблону(Шаблон, Получатель, Неопределено);
	//		
	//		ОтправитьТекстовоеСообщение(HTTPСоединения.Основное,Получатель.Идентификатор, ТекстСообщения,,, HTTPСоединения.Бот);
	//		
	//		Возврат;
	//		
	//	КонецЕсли;
	//	
	//	Логин = СокрЛП(СтрЗаменить(Сообщение.text, "/login", ""));
	//	
	//	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Логин);
	//	Если ПользовательИБ <> Неопределено И НЕ ПустаяСтрока(Логин) Тогда
	//		
	//		Рандом = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	//		Код = Рандом.СлучайноеЧисло();
	//		
	//		ПолучательОбъект = Получатель.ПолучитьОбъект();
	//		ПолучательОбъект.КодПодтверждения = Формат(Код, "ЧЦ=10; ЧВН=; ЧГ=0");
	//		ПолучательОбъект.ОбменДанными.Загрузка = Истина;
	//		ПолучательОбъект.ДополнительныеСвойства.Вставить("НеРегистрироватьДляОбмена", Истина);
	//		ПолучательОбъект.Записать();
	//		
	//		Шаблон = Справочники.бит_омни_ШаблоныСообщений.КодПодтверждения;
	//		ТекстСообщения = СформироватьТекстСообщенияПоШаблону(Шаблон, Получатель, Неопределено);
	//		
	//		ОтправитьТекстовоеСообщение(HTTPСоединения.Основное,Получатель.Идентификатор, ТекстСообщения, ,,HTTPСоединения.Бот);
	//		
	//	КонецЕсли;
	//КонецЕсли;

КонецПроцедуры

Процедура ЗарегистрироватьСообщение(message_id, Контекст, Контакт, Бот)
	
	мзСообщение = РегистрыСведений.бит_омни_Сообщения.СоздатьМенеджерЗаписи();
	мзСообщение.Период = ТекущаяДата();
	мзСообщение.Message_id = message_id;
	
	ТипКонтекста = ТипЗнч(Контекст); 
	ЭтоСсылка = ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Контекст));
	
	ИсключаемыеТипы = Новый ОписаниеТипов("Булево, Строка, Дата, Null, Число");
	
	ЕстьРеквизитСсылка = Ложь;
	Если НЕ ИсключаемыеТипы.СодержитТип(ТипКонтекста)
		И Контекст <> Неопределено 
	Тогда				  
		ЕстьРеквизитСсылка = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Ссылка");
	КонецЕсли;	
		
	Если ЭтоСсылка Тогда
		мзСообщение.ИдентификаторОбсуждения = Контекст.УникальныйИдентификатор();
	ИначеЕсли ЕстьРеквизитСсылка Тогда
		мзСообщение.ИдентификаторОбсуждения = Контекст.Ссылка.УникальныйИдентификатор()	
	КонецЕсли;
	
	мзСообщение.Контакт = Контакт;
	мзСообщение.Бот = Бот.Ссылка;
	
	мзСообщение.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ИсходящиеСообщения


Процедура УстановитьСтатус(Знач HTTPСоединение, Знач ИдентификаторПолучателя, Статус)
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Host", "api.telegram.org");
	
	HTTPЗапрос = Новый HTTPЗапрос("/sendChatAction", Заголовки);
	
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("chat_id", ИдентификаторПолучателя);
	СтруктураСообщения.Вставить("action", Статус);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураСообщения);
	СтрокаЗапроса = ЗаписьJSON.Закрыть();
	
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса);
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);

КонецПроцедуры

Процедура ОтправитьТекстовоеСообщение(Знач HTTPСоединение, Знач ИдентификаторПолучателя, Знач ТекстСообщения, Контекст = Неопределено, Формат = Неопределено, Бот) 
	
	УстановитьСтатус(HTTPСоединение, ИдентификаторПолучателя, "typing");	
		
	Контакт = Справочники.бит_омни_Контакты.НайтиПоРеквизиту("Идентификатор", ИдентификаторПолучателя);

	ReplyTo = Неопределено;

	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("chat_id", ИдентификаторПолучателя);
	СтруктураСообщения.Вставить("text", Строка(ТекстСообщения));

	Если ReplyTo <> Неопределено Тогда
		СтруктураСообщения.Вставить("reply_to_message_id", ReplyTo);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(формат) Тогда
		СтруктураСообщения.Вставить("parse_mode", Формат);
	КонецЕсли;
	
	Inline_keyboard = ДобавитьКомандыКСообщению(Контакт, Контекст);
	
	Если Inline_keyboard.Количество() > 0 Тогда
		СтруктураСообщения.Вставить("reply_markup", Новый Структура);
		СтруктураСообщения.reply_markup.Вставить("inline_keyboard", Inline_keyboard);
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураСообщения);
	СтрокаЗапроса = ЗаписьJSON.Закрыть();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Host", "api.telegram.org");
	HTTPЗапрос = Новый HTTPЗапрос("/sendMessage", Заголовки);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса);
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстОтвета);
	СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);

	Если СтруктураОтвета.ok = Истина Тогда
		Если Контекст <> Неопределено Тогда
			ЗарегистрироватьСообщение(СтруктураОтвета.result.message_id, Контекст, Контакт, Бот);
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(СтруктураОтвета.description,,"Не удалось отправить сообщение в  пользователю " + Контакт.Наименование);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьВложение(Знач HTTPСоединение, Знач ИдентификаторПолучателя, Знач Вложение, Контекст = Неопределено, Бот)
	
	УстановитьСтатус(HTTPСоединение, ИдентификаторПолучателя, "upload_document");
	Контакт = Справочники.бит_омни_Контакты.НайтиПоРеквизиту("Идентификатор", ИдентификаторПолучателя);
	
	Если Контекст <> Неопределено Тогда
		ReplyTo = ПолучитьСамоеПервоеСообщениеПоСсылке(Контекст, Контакт);
	Иначе
		ReplyTo = Неопределено;
	КонецЕсли;

	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("chat_id", Формат(ИдентификаторПолучателя, "ЧГ=0"));

	Если ReplyTo <> Неопределено Тогда
		СтруктураСообщения.Вставить("reply_to_message_id", Формат(ReplyTo, "ЧГ=0"));
	КонецЕсли;
	
	Разделитель = "----" + Строка(Новый УникальныйИдентификатор());
	ПутьКФайлу = СохранитьПрикрепленныйФайл(Вложение);
	ИмяФайла = Вложение.Наименование;
	
	Файл = Новый Файл(ПутьКФайлу);

	//Определяем массив для процедуры ОбъединитьФайлы
	МассивФайловДляОбъединения = Новый Массив;
	
	МассивФайловДляОбъединения.Добавить(ПолучитьИмяВременногоФайла("txt"));
	ФайлОтправкиНачало = Новый ЗаписьТекста(МассивФайловДляОбъединения[0], КодировкаТекста.UTF8);
	НачальныеДанные = "--%Разделитель%
	|Content-Disposition: form-data; name=""chat_id""
	|
	|%chat_id%
	|--%Разделитель%
	|Content-Disposition: form-data; name=""reply_to_message_id""
	|
	|%reply_to_message_id%
	|--%Разделитель%
	|Content-Disposition: form-data; name=""document""; filename=""%ИмяФайла%""
	|";
	НачальныеДанные = СтрЗаменить(НачальныеДанные,"%Разделитель%",Разделитель);
	НачальныеДанные = СтрЗаменить(НачальныеДанные,"%chat_id%",СтруктураСообщения.chat_id);
	НачальныеДанные = СтрЗаменить(НачальныеДанные,"%reply_to_message_id%",?(СтруктураСообщения.Свойство("reply_to_message_id"), СтруктураСообщения.reply_to_message_id, ""));
	НачальныеДанные = СтрЗаменить(НачальныеДанные,"%ИмяФайла%",ИмяФайла);
	
	ФайлОтправкиНачало.ЗаписатьСтроку(НачальныеДанные );
	ФайлОтправкиНачало.Закрыть();
	
	МассивФайловДляОбъединения.Добавить(ПутьКФайлу);
	
	МассивФайловДляОбъединения.Добавить(ПолучитьИмяВременногоФайла("txt"));
	ФайлаОтправкиКонец = Новый ЗаписьТекста(МассивФайловДляОбъединения[2], КодировкаТекста.UTF8);
	КонечныеДанные = "
	|--%Разделитель%--";
	КонечныеДанные = СтрЗаменить(КонечныеДанные,"%Разделитель%",Разделитель);
	
	ФайлаОтправкиКонец.ЗаписатьСтроку(КонечныеДанные);
	ФайлаОтправкиКонец.Закрыть();
	
	ИмяИтоговогоФайла = ПолучитьИмяВременногоФайла("txt");
	ОбъединитьФайлы(МассивФайловДляОбъединения, ИмяИтоговогоФайла);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "multipart/form-data; boundary=" + Разделитель);
	Заголовки.Вставить("Host", "api.telegram.org");
	HTTPЗапрос = Новый HTTPЗапрос("/sendDocument", Заголовки);
	    	
	HTTPЗапрос.УстановитьИмяФайлаТела(ИмяИтоговогоФайла);
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстОтвета);
	
	СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
	
	Если СтруктураОтвета.ok = Истина Тогда
		
		Если Контекст <> Неопределено Тогда
			ЗарегистрироватьСообщение(СтруктураОтвета.result.message_id, Контекст, Контакт, Бот);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьКомандыКСообщению(Знач Контакт, Знач Ссылка)
	
	Inline_keyboard = Новый Массив; //Массив строк команд
	МассивКомманд = Новый Массив;   //Массив с первой строкой команд
	МассивКомманд2 = Новый Массив;  //Массив со второй строкой команд, аналогично можно добавить еще строки, но двух обычно хватает
	ТипСсылки = ТипЗнч(Ссылка);
	//НС = ПолучитьНавигационнуюСсылку(Ссылка);
	//МассивКомманд.Добавить(Новый Структура("text, switch_inline_query_current_chat", "Обосновано", "/justified " + НС));	
	
	Если МассивКомманд.Количество() > 0 Тогда
		Inline_keyboard.Добавить(МассивКомманд);
	КонецЕсли;
	Если МассивКомманд2.Количество() > 0 Тогда
		Inline_keyboard.Добавить(МассивКомманд2);
	КонецЕсли;
	
	Возврат Inline_keyboard;

КонецФункции

#КонецОбласти

#Область РаботаСФайлами

Функция СохранитьПрикрепленныйФайл(Файл)
	
	ДвоичныеДанныеФайла = Файл.Хранилище.Получить(); 
	УчетнаяПолитика = ПараметрыСеанса.УчетнаяПолитика;
	
	Если УчетнаяПолитика.ХранитьФотоКлиентовКакФайлы 
		ИЛИ ДвоичныеДанныеФайла = Неопределено 
	Тогда //Храним файлами     
		ОбщийМодульРаботыСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
		КаталогХраненияФайла = ОбщийМодульРаботыСФайлами.ПолучитьБазовыйКаталогФайлов(Файл.Объект);
		ИмяФайла = КаталогХраненияФайла + Файл.Наименование;
	Иначе
		ИмяФайла = ПолучитьИмяВременногоФайла(Файл.Расширение);
		ДвоичныеДанныеФайла.Записать(ИмяФайла);
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции

Функция ПолучитьФайлПоID(file_id, HTTPСоединения)
	
	HTTPЗапрос = Новый HTTPЗапрос("/getFile?file_id=" + file_id);
	HTTPОтвет = HTTPСоединения.Основное.Получить(HTTPЗапрос);
	
	ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстОтвета);
	
	СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
	
	Если СтруктураОтвета.ok = Истина Тогда
		
		СоставИмениФайла = СтрРазделить(СтруктураОтвета.result.file_path, ".");
		СоставПутиФайла = СтрРазделить(СтруктураОтвета.result.file_path, "/");
		
		ИмяФайла = СоставПутиФайла[СоставПутиФайла.ВГраница()];
		Расширение = СоставИмениФайла[СоставИмениФайла.ВГраница()];
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
		
		HTTPЗапрос = Новый HTTPЗапрос("/" + СтруктураОтвета.result.file_path);
		HTTPСоединения.Файлы.Получить(HTTPЗапрос, ИмяВременногоФайла);
		СтруктраВозврата = Новый Структура("ИмяФайла, ПутьКФайлу", ИмяФайла, ИмяВременногоФайла);
		
		Возврат СтруктраВозврата;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПолучениеПолучателей
 


#КонецОбласти

#Область ПолучениеКонтактаТелеграм

Функция ПолучитьКонтактПоUser(Знач User)
	
	Получатель = Справочники.бит_омни_Контакты.НайтиПоРеквизиту("Идентификатор", User.id);
	
	Если Получатель.Пустая() Тогда
		ПолучательОбъект = Справочники.бит_омни_Контакты.СоздатьЭлемент();
		Если User.Свойство("type") Тогда
			ИмяПользователя = User.title;
			Тип = User.type;
		Иначе
			ИмяПользователя = ?(User.Свойство("last_name"), User.first_name + " " + User.last_name, User.first_name);
			Тип = "private";
		КонецЕсли;
		ПолучательОбъект.Наименование = ИмяПользователя;
		ПолучательОбъект.Идентификатор = User.id;
		ПолучательОбъект.Тип = Тип;
		ПолучательОбъект.ОбменДанными.Загрузка = Истина;
		ПолучательОбъект.ДополнительныеСвойства.Вставить("НеРегистрироватьДляОбмена", Истина);
		ПолучательОбъект.УстановитьНовыйКод();
		ПолучательОбъект.Записать();
		Получатель = ПолучательОбъект.Ссылка;
	КонецЕсли;
	
	Возврат Получатель;

КонецФункции

Функция ПолучитьКонтактПоПользователю1С(Пользователь1С) Экспорт
	Если ЗначениеЗаполнено(Пользователь1С) Тогда
		Возврат Справочники.бит_омни_Контакты.НайтиПоРеквизиту("Пользователь1С", Пользователь1С);
	Иначе
		Возврат Справочники.бит_омни_Контакты.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция НаличиеДиалогаСПользователем(Пользователь1С, Бот) Экспорт
	
	КонтактТелеграм = ПолучитьКонтактПоПользователю1С(Пользователь1С);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_омни_Сообщения.Message_id КАК Message_id
	|ИЗ
	|	РегистрСведений.бит_омни_Сообщения КАК бит_омни_Сообщения
	|ГДЕ
	|	бит_омни_Сообщения.Контакт = &Контакт
	|	И бит_омни_Сообщения.Бот = &Бот";
	
	Запрос.УстановитьПараметр("Контакт", КонтактТелеграм);
	Запрос.УстановитьПараметр("Бот", Бот);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции	

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

Процедура ИзменитьСмещение(Бот, НовоеСмещение)

	МенеджерЗаписи = РегистрыСведений.бит_омни_СмещениеБотов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Бот = Бот.Ссылка;
	МенеджерЗаписи.Смещение = НовоеСмещение;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ПолучитьАктивныхБотов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_омни_Боты.Ссылка КАК Ссылка,
	|	бит_омни_Боты.Идентификатор КАК Идентификатор,
	|	ЕСТЬNULL(бит_омни_СмещениеБотов.Смещение, 0) КАК Смещение
	|ИЗ
	|	Справочник.бит_омни_Боты.Принадлежность КАК бит_БотыПринадлежность
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_омни_Боты КАК бит_омни_Боты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_омни_СмещениеБотов КАК бит_омни_СмещениеБотов
	|			ПО бит_омни_СмещениеБотов.Бот = бит_омни_Боты.Ссылка
	|		ПО бит_БотыПринадлежность.Ссылка = бит_омни_Боты.Ссылка
	|ГДЕ
	|	бит_омни_Боты.Использовать
	|	И НЕ бит_омни_Боты.ПометкаУдаления
	|	И бит_омни_Боты.Идентификатор <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_омни_Боты.Ссылка,
	|	бит_омни_Боты.Идентификатор,
	|	бит_омни_СмещениеБотов.Смещение";
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции

Функция ПолучитьБотаПоМетаданным(ИмяОбъекта, ПолучитьВсе = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ //%ПЕРВЫЕОДИН%
	|	бит_омни_Боты.Ссылка КАК Ссылка,
	|	бит_омни_Боты.Идентификатор КАК Идентификатор
	|ИЗ
	|	Справочник.бит_омни_Боты.Принадлежность КАК бит_БотыПринадлежность
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_омни_Боты КАК бит_омни_Боты
	|		ПО бит_БотыПринадлежность.Ссылка = бит_омни_Боты.Ссылка
	|ГДЕ
	|	бит_омни_Боты.Использовать
	|	И НЕ бит_омни_Боты.ПометкаУдаления
	|	И бит_омни_Боты.Идентификатор <> """"
	|	И бит_БотыПринадлежность.Объект = &ИмяОбъекта
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_омни_Боты.Ссылка,
	|	бит_омни_Боты.Идентификатор";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "//%ПЕРВЫЕОДИН%", ?(ПолучитьВсе, "", "ПЕРВЫЕ 1"));
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);
	
	Если ПолучитьВсе Тогда
		Выгрузка = Запрос.Выполнить().Выгрузить();
		
		Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Выгрузка);
	Иначе	
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция СоздатьСоединение(Бот)
	
	ШаблонСтрокиURLДляФайлов = "api.telegram.org/file/bot%1/";	
	ШаблонСтрокиURL = "api.telegram.org/bot%1/";
	
	URL = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтрокиURL, Бот.Идентификатор);
	URLДляФайлов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтрокиURLДляФайлов, Бот.Идентификатор);
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows());
	HTTPСоединение = Новый HTTPСоединение(URL,,,,,,ЗащищенноеСоединение);
	HTTPСоединениеДляФайлов = Новый HTTPСоединение(URLДляФайлов,,,,,,ЗащищенноеСоединение);
	
	СтруктураВозврата = Новый Структура("Основное, Файлы, Бот", HTTPСоединение, HTTPСоединениеДляФайлов, Бот);
	
	Возврат СтруктураВозврата;

КонецФункции

Функция ПолучитьСамоеПервоеСообщениеПоСсылке(Ссылка, Контакт)

	ИдентификаторОбсуждения = Ссылка.УникальныйИдентификатор();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_омни_Сообщения.Message_id КАК Message_id
	|ИЗ
	|	РегистрСведений.бит_омни_Сообщения КАК бит_омни_Сообщения
	|ГДЕ
	|	бит_омни_Сообщения.Контакт = &Контакт
	|	И бит_омни_Сообщения.ИдентификаторОбсуждения = &ИдентификаторОбсуждения
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_омни_Сообщения.Период";
	Запрос.УстановитьПараметр("ИдентификаторОбсуждения", ИдентификаторОбсуждения);
	Запрос.УстановитьПараметр("Контакт", Контакт);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Message_id;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ОбработатьРассылкиПоБоту(HTTPСоединения)

	Бот = HTTPСоединения.Бот.Ссылка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_омни_АктивныеРассылки.Рассылка КАК Рассылка,
	|	бит_омни_Рассылки.Шаблон КАК Шаблон,
	|	бит_омни_Рассылки.СКДПолучатели КАК СКДПолучатели,
	|	бит_омни_Рассылки.СКДКонтекст КАК СКДКонтекст,
	|	бит_омни_Рассылки.Расписание КАК Расписание,
	|	бит_омни_АктивныеРассылки.ДатаНачалаПоследнегоЗапуска КАК ДатаНачалаПоследнегоЗапуска,
	|	бит_омни_АктивныеРассылки.ДатаЗавершенияПоследнегоЗапуска КАК ДатаЗавершенияПоследнегоЗапуска
	|ИЗ
	|	РегистрСведений.бит_омни_АктивныеРассылки КАК бит_омни_АктивныеРассылки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_омни_Рассылки КАК бит_омни_Рассылки
	|		ПО бит_омни_АктивныеРассылки.Рассылка = бит_омни_Рассылки.Ссылка
	|ГДЕ
	|	бит_омни_АктивныеРассылки.Бот = &Бот";
	
	Запрос.УстановитьПараметр("Бот", Бот);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Расписание = Выборка.Расписание.Получить();
		ТребуетсяВыполнение = Расписание.ТребуетсяВыполнение(ТекущаяДата(), Выборка.ДатаНачалаПоследнегоЗапуска, Выборка.ДатаЗавершенияПоследнегоЗапуска);
		
		Если ТребуетсяВыполнение Тогда
			
			ДатаЗапуска = ТекущаяДата();
			
			ПоследнийЗапуск = РегистрыСведений.бит_омни_АктивныеРассылки.СоздатьМенеджерЗаписи();
			ПоследнийЗапуск.Бот = Бот;
			ПоследнийЗапуск.Рассылка = Выборка.Рассылка;
			ПоследнийЗапуск.ДатаНачалаПоследнегоЗапуска = ДатаЗапуска;
			ПоследнийЗапуск.ДатаЗавершенияПоследнегоЗапуска = ДатаЗапуска;
			ПоследнийЗапуск.Записать();
			
			ПолучателиСКД = Выборка.СКДПолучатели.Получить();
			
			МодульСКД = ОбщегоНазначения.ОбщийМодуль("бит_омни_СхемыКомпоновки");
			ПараметрыСКД = МодульСКД.ПараметрыВыполненияСхемы();
			ПараметрыСКД.КудаВывести = "ТаблицаЗначений";
			
			Результат = МодульСКД.ВыполнитьСхему(ПолучателиСКД, ПараметрыСКД);
			Получатели = Результат.ВыгрузитьКолонку("Получатель");
			
			КонтекстСКД = Выборка.СКДКонтекст.Получить();
			Результат = МодульСКД.ВыполнитьСхему(КонтекстСКД, ПараметрыСКД);
			
			Если Результат.Количество() Тогда
				бит_омни_РаботаССообщениями.ОтправитьСообщениеВТелеграм(HTTPСоединения, Выборка.Шаблон, Результат, Получатели);
			КонецЕсли;                                 
			
			ПоследнийЗапуск.ДатаЗавершенияПоследнегоЗапуска = ТекущаяДата();
			ПоследнийЗапуск.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
